WebServiceApp/getGcdList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:ms="http://my.sample/web-service-app">
   <soapenv:Header/>
   <soapenv:Body>
      <ms:getGcdList>
         <ms:name>1</ms:name>
      </ms:getGcdList>
   </soapenv:Body>
</soapenv:Envelope>